** Source code blocks

To enclose souce code, we use a source block. We can tell org-mode what
kind of source code it is e.g. sh for shell.

#+begin_src shell
  echo "hello $USER! Today is `date`"
  sleep 2
  echo "Goodbye!!"
  exit
#+end_src

#+RESULTS:
| hello     | krm! | Today | is | Sun | 11 | Jun | 2023 | 10:41:15 | AM | EAT |
| Goodbye!! |      |       |    |     |    |     |      |          |    |     |

We can get org to syntax highlight by adding the following in the
emacs config file

#+begin_src elisp
  ;; synax hightlight code blocks
  ;; set this in .emacs or emacs.d/init.el
  (setq org-src-fontify-natively t)
#+end_src

When inside the source block, C-c ' will open a buffer in the major
mode of the programming language specified. C-c ' again will return
to the org document and show the additional edits.

C-c C-c inside a code block will execute it.

Some further examples on babel (code execution) [[https://orgmode.org/worg/org-contrib/babel/intro.html][here]].

See [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][this]] for language specific documentation

We can tell org-mode which languages to support by adding something
like the following in the emacs config file

#+BEGIN_SRC elisp
;; Some initial languages we want org-babel to support
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (sh . t)
   (python . t)
   (R . t)
   (ditaa . t)
   (perl . t)
   (gnuplot t)
   ))
#+END_SRC


#+begin_src python :results output
  import time
  print("todays date is %s" % time.ctime())
  print("2 + 2")
  print(2 + 2)
  import sys
  print(sys.version)
#+end_src

#+RESULTS:
: todays date is Sun Jun 11 10:42:08 2023
: 2 + 2
: 4
: 3.8.10 (default, May 26 2023, 14:05:08) 
: [GCC 9.4.0]

More on literate programming [[file:literate_programming.org][here]]

Compact guide: https://orgmode.org/guide/


